Autodesk.Revit.DB.ForgeDM.CloudFolder.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ForgeDM.CloudFolder.Name
Name for CloudFolder
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudFolder.Id
Identifier for CloudFolder
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudFolder.#ctor(System.String,System.String)
Default constructor for CloudFolder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudFolder.#ctor(Autodesk.Revit.DB.ForgeDM.CloudFolder)
For communication between Revit and Collaborate add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.ForgeDM.CloudFolder
A folder from Forge DM (Data Management, see , see https://developer.autodesk.com/en/docs/data/v2/overview/).
Represents Identifier of current Folder.
Represents Name of current Folder.
Remarks:
Usable by both Revit and Collaborate add-in.
Since:
2019